## Eleman İşlemleri

In [20]:
import numpy as np
import pandas as pd

In [21]:
s1 = np.random.randint(10, size =5)
s2 = np.random.randint(10, size =5)
s3 = np.random.randint(10, size =5)

In [22]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [23]:
sozluk

{'var1': array([1, 0, 7, 5, 5]),
 'var2': array([2, 5, 5, 4, 1]),
 'var3': array([7, 2, 9, 0, 1])}

In [24]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     2     7
1     0     5     2
2     7     5     9
3     5     4     0
4     5     1     1

In [25]:
df[0:1]

   var1  var2  var3
0     1     2     7

In [26]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     1     2     7
b     0     5     2
c     7     5     9
d     5     4     0
e     5     1     1

In [28]:
df["c":"e"]

   var1  var2  var3
c     7     5     9
d     5     4     0
e     5     1     1

In [29]:
# silme işlemi

df.drop("a", axis=0)

   var1  var2  var3
b     0     5     2
c     7     5     9
d     5     4     0
e     5     1     1

In [30]:
df

   var1  var2  var3
a     1     2     7
b     0     5     2
c     7     5     9
d     5     4     0
e     5     1     1

In [31]:
# inplace işlemi değişikliği kalıcı yapar. df'e kaydeder.
df.drop("a", axis=0, inplace = True)

In [32]:
# fancy ile silme işlemi
l= ["c","e"]

In [33]:
df.drop(l,axis=0)

   var1  var2  var3
b     0     5     2
d     5     4     0

In [ ]:
# değişkenler için

In [34]:
"var" in df

False

In [35]:
l = ["var1","var4","var2"]

In [36]:
for i in l:
    print(i in df)

True
False
True

In [37]:
df

   var1  var2  var3
b     0     5     2
c     7     5     9
d     5     4     0
e     5     1     1

In [ ]:
#değişken oluşturma

In [38]:
df["var4"] = df["var1"]/ df["var2"]
df

   var1  var2  var3  var4
b     0     5     2  0.00
c     7     5     9  1.40
d     5     4     0  1.25
e     5     1     1  5.00

In [39]:

# değişken silmek

df.drop("var4", axis =1)
df

   var1  var2  var3  var4
b     0     5     2  0.00
c     7     5     9  1.40
d     5     4     0  1.25
e     5     1     1  5.00

In [41]:
df.drop("var4", axis =1, inplace = True)
df

   var1  var2  var3
b     0     5     2
c     7     5     9
d     5     4     0
e     5     1     1

In [42]:
# fancy ile silme

l = ["var1","var2"]

In [43]:
df.drop(l,axis = 1)

   var3
b     2
c     9
d     0
e     1